/*
 *  삼항연산자 (48페이지)  : if~else
 *    > 소스가 복잡한 경우 사용  >  웹(HTML+JAVA)
 *     형식 : (조건)?값1:값2
 *        > 조건이 참이면 값1
 *               거짓이면 값2
 *  3장 : 54~55페이지
 *      > 조건문 : 필요시 문장 수행, 불필요시 건너뛴다
 *                > 참             >거짓
 *          
 *      형식 :
 *      if(조건문)   >> 부정연산자 / 비교연산자 / 논리연산자 사용가능
 *      {
 *       수행문장 >> 조건문이 참일때 수행
 *      }          
 *                >>>>> for 가장 많이 사용
 *                >>>>> 주의점
 *                if()
 *                {
 *                }
 *                if(); >> 모든 문장 수행
 *                {
 *                }
 *                >>>>> {} 언제든 사용가능
 *                >>>>>  반대  >>>  !전체조건
 *  
 */
public class 자바제어문_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
