// 한 줄 주석
/* 여러 줄 주석
 * */ 

/*
 *  2. 환경설정
 *   >내피씨-속성-고습시스템-설정-환경변수 선택
 * 
 *  3. 편집기 
 *   >이클립스 통합개발툴 무료
 *   >백엔드(자바,웹,스프링)
 *    -이클립스.오알지 다운
 *   >인텔리제이 백엔드-프론트
 *    -씨버전 무료/피버전 유료
 *   >파일-뉴-자바프로젝트 선택-프로젝트 폴더 생성
 *    - 에스알씨 안에 클래스 만들어서 사용
 *      - 프로그램의 시작점-메인
 *      
 *  주의점) 19페이지
 *  
 *  1. 자바 파일명과 클래스명 동일
 *  
 *  2. 대소문자 구분
 *     * 자바개발자의 약속 *
 *         - 클래스명은 대문자로 시작 (헝거리언식 표기)
 *         - 변수/메소드 - 소문자로 시작
 *         - 상수 - 전체 대문자로 시작
 *         - 가급적이면 의미 부여
 *  
 *  3. 문장 종료(명령어) - ; , .
 *     > 오라클 ;    
 *  
 *  4. 변수 : 변경 가능
 *       - int age;  
 *     상수 : 변경 불가능
 *       - final int age;
 *       - 리터럴 : 실제 저장된 값
 *       
 *  들여쓰기) 22페이지
 *  
 *  자바의 주석) 23페이지 - 컴파일 예외
 *  
 *    // ctrl+shift+/
	  // ctrl+shift+\
 *    HTML <!-- -->
 *    CSS //
 *    Python # , """ """
 *    JSP <%-- --%>
 *  
 *  
 *    자바의 구성요소
 *    
 *    퍼블릭 클래스 클래스네임 - 클래스 시작
 *    {
 *      // 프로그램 시작점> 모든프로그램은 반드시 메인 1개가 존재
 *      퍼블릭 스타틱 보이드 메인(스트링)
 *      { -------메소드 시작
 *        ----------기능수행  -  소스코딩
 *      }  ------메소드 종료
 *    }    ------클래스 종료   
 *    
 *  +확장
 *   
 *   퍼블릭 클래스 클래스 네임{
 *     ======== 변수
 *     ======== 생성자 --- 변수의 초기화
 *     ======== 사용자 정의 메소드  --- 게시판 목록 / 게시판 등록 / 게시판 상세 / 게시판 수정 / 게시판 삭제
 *     ======== 메인() --- CBD  > 조립식
 *   }  
 *  
 * 
 *   
 *   
 * */
public class 자바소개_특징 {


	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		  System.out.println("!!"); 
		  System.out.println("!!"); 
		  System.out.println("!!");
		  System.out.println("!!");
		  System.out.println("!!");
		  System.out.println("!!");
		  System.out.println("!!");
		

	}

}
